# SpacingRuleJustification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..SpacingRuleJustification Property
DividedPath Class See Also
---
When the layout is set to 'FixedDistance' the points may not cover the entire range of the path. The justification determines whether the points are centered on the range, or shifted towards the start or end of the range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SpacingRuleJustification SpacingRuleJustification { get; set; }
```

Visual Basic
---
```text
Public Property SpacingRuleJustification As SpacingRuleJustification
	Get
	Set
```

Visual C++
---
```text
public:
property SpacingRuleJustification SpacingRuleJustification {
	SpacingRuleJustification get ();
	void set (SpacingRuleJustification value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: Invalid justification -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace